; domain
; source => https://github.com/AI-Planning/pddl-generators/blob/main/spanner/domain.pddl
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(usable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))

(:action walk
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start)
                           (link ?start ?end))
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l)
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l)
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (usable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n)) (not (usable ?s)) (tightened ?n)))
)

; problem
;; spanners=6, nuts=3, locations=7, out_folder=training/easy, instance_id=62, seed=89

(define (problem spanner-62)
 (:domain spanner)
 (:objects 
    bob - man
    spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 - spanner
    nut1 nut2 nut3 - nut
    shed location1 location2 location3 location4 location5 location6 location7 gate - location
 )
 (:init 
    (at bob shed)
    (at spanner1 location1)
    (usable spanner1)
    (at spanner2 location7)
    (usable spanner2)
    (at spanner3 location5)
    (usable spanner3)
    (at spanner4 location6)
    (usable spanner4)
    (at spanner5 location3)
    (usable spanner5)
    (at spanner6 location2)
    (usable spanner6)
    (at nut1 gate)
    (loose nut1)
    (at nut2 gate)
    (loose nut2)
    (at nut3 gate)
    (loose nut3)
    (link shed location1)
    (link location7 gate)
    (link location1 location2)
     (link location2 location3)
     (link location3 location4)
     (link location4 location5)
     (link location5 location6)
     (link location6 location7)
 )
 (:goal  (and (tightened nut1)
   (tightened nut2)
   (tightened nut3))))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 3
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 3
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 3
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 3
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 3
6. (pickup_spanner location5 spanner3 bob)
   deleted: (at spanner3 location5)
   added: (carrying bob spanner3)
   goals met: 0 of 3
7. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 3
8. (pickup_spanner location6 spanner4 bob)
   deleted: (at spanner4 location6)
   added: (carrying bob spanner4)
   goals met: 0 of 3
9. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 3
10. (pickup_spanner location7 spanner2 bob)
   deleted: (at spanner2 location7)
   added: (carrying bob spanner2)
   goals met: 0 of 3
11. (walk location7 gate bob)
   deleted: (at bob location7)
   added: (at bob gate)
   goals met: 0 of 3
12. (tighten_nut gate spanner2 bob nut1)
   deleted: (loose nut1) (usable spanner2)
   added: (tightened nut1)
   goals met: 1 of 3
13. (tighten_nut gate spanner3 bob nut2)
   deleted: (loose nut2) (usable spanner3)
   added: (tightened nut2)
   goals met: 2 of 3
14. (tighten_nut gate spanner4 bob nut3)
   deleted: (loose nut3) (usable spanner4)
   added: (tightened nut3)
   goals met: 3 of 3
